Revit 2024 API
NumberingSchemaTypes Class
Provides a container of all Revit built-in NumberingSchemaType instances.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class NumberingSchemaTypes
Visual Basic
Public NotInheritable Class NumberingSchemaTypes
Visual C++
public ref class NumberingSchemaTypes abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.NumberingSchemaTypes
See Also
Autodesk.Revit.DB Namespace